Revit 2026 API

# DirectContext3DHandleSettingsAssign Method

---

Assigns values of the source settings to this object.

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Assign(
	DirectContext3DHandleSettings other
)
```
```vb
Public Sub Assign (
	other As DirectContext3DHandleSettings
)
```
```cpp
public:
void Assign(
	DirectContext3DHandleSettings^ other
)
```
```fsharp
member Assign :
        other : DirectContext3DHandleSettings -> unit
```

#### Parameters

other DirectContext3DHandleSettings
     The source settings.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

DirectContext3DHandleSettings Class

Autodesk.Revit.DB.DirectContext3D Namespace